In [4]:
import pandas as pd
# create a simple dataset of people
data = {'Name': ["John", "Anna", "Peter", "Linda"],
        'Location' : ["New York", "Paris", "Berlin", "London"],
        'Age' : [24, 13, 53, 33], 'Male o Female': ['Male', 'Female', 'Male', 'Female']}
# Se agraga ultima columna a modo de ejemplo 'Male or Female'
data_pandas = pd.DataFrame(data)
# IPython.display allows "pretty printing" of dataframes
# in the Jupyter notebook
display(data_pandas)

    Name  Location  Age Male o Female
0   John  New York   24          Male
1   Anna     Paris   13        Female
2  Peter    Berlin   53          Male
3  Linda    London   33        Female

In [5]:
# Select all rows that have an age column greater than 30
display(data_pandas[data_pandas.Age > 30])

    Name Location  Age Male o Female
2  Peter   Berlin   53          Male
3  Linda   London   33        Female

In [6]:
# Mostrar filas de sujetos menores de 50.
display(data_pandas[data_pandas.Age < 50])

    Name  Location  Age Male o Female
0   John  New York   24          Male
1   Anna     Paris   13        Female
3  Linda    London   33        Female